tiborsimon/embedded-tdd-headers/pic/8bit/pic18c601_tdd.h
#define PCFG1                         522
#define PCFG2                         523
#define CHSN3                         524
#define PCFG3                         525
#define VCFG                          526
#define VCFG0                         527
#define VCFG01                        528
#define VCFG11                        529
#define VCFG1                         530
#define ADCON0                        531
#define ADON                          532
#define nDONE                         533
#define GO_nDONE                      534
#define NOT_DONE                      535
#define GODONE                        536
#define GO_DONE                       537
#define DONE                          538
#define GO_NOT_DONE                   539
#define GO                            540
#define CHS                           541
#define CHS0                          542
#define CHS1                          543
#define CHS2                          544
#define CHS3                          545
#define SSPCON2                       546
#define SEN                           547
#define RSEN                          548
#define PEN                           549
#define RCEN                          550
#define ACKEN                         551
#define ACKDT                         552
#define ACKSTAT                       553
#define GCEN                          554
#define SSPCON1                       555
#define SSPM0                         556
#define SSPM                          557
#define SSPM1                         558
#define SSPM2                         559
#define SSPM3                         560
#define CKP                           561
#define SSPEN                         562
#define SSPOV                         563
#define WCOL                          564
#define SSPSTAT                       565
#define BF                            566
#define UA                            567
#define R_NOT_W                       568
#define READ_WRITE                    569
#define NOT_W                         570
#define R_W                           571
#define RW                            572
#define R                             573
#define NOT_WRITE                     574
#define nW                            575
#define nWRITE                        576
#define R_nW                          577
#define I2C_READ                      578
#define START                         579
#define S                             580
#define I2C_START                     581
#define STOP                          582
#define I2C_STOP                      583
#define P                             584
#define NOT_A                         585
#define I2C_DATA                      586
#define nA                            587
#define D_nA                          588
#define D                             589
#define DA                            590
#define DATA_ADDRESS                  591
#define D_A                           592
#define D_NOT_A                       593
#define NOT_ADDRESS                   594
#define nADDRESS                      595
#define I2C_DAT                       596
#define CKE                           597
#define SMP                           598
#define T2CON                         599
#define T2CKPS0                       600
#define T2CKPS                        601
#define T2CKPS1                       602
#define TMR2ON                        603
#define TOUTPS0                       604
#define TOUTPS                        605
#define TOUTPS1                       606
#define TOUTPS2                       607
#define TOUTPS3                       608
#define T1CON                         609
#define TMR1ON                        610
#define TMR1CS                        611
#define NOT_T1SYNC                    612
#define T1SYNC                        613
#define nT1SYNC                       614
#define T1INSYNC                      615
#define T1OSCEN                       616
#define SOSCEN                        617
#define T1CKPS0                       618
#define T1CKPS                        619
#define T1CKPS1                       620
#define T1RD16                        621
#define T1CON_RD16                    622
#define RCON                          623
#define NOT_BOR                       624
#define nBOR                          625
#define POR                           626
#define nPOR                          627
#define NOT_POR                       628
#define nPD                           629
#define NOT_PD                        630
#define PD                            631
#define NOT_TO                        632
#define nTO                           633
#define TO                            634
#define nRI                           635
#define NOT_RI                        636
#define RI                            637
#define nIPEN                         638
#define IPEN                          639
#define NOT_IPEN                      640
#define WDTCON                        641
#define SWDTEN                        642
#define SWDTE                         643
#define SWDPS0                        644
#define WDPS0                         645
#define SWDPS                         646
#define SWDPS1                        647
#define WDPS1                         648
#define SWDPS2                        649
#define WDPS2                         650
#define LVDCON                        651
#define LVV0                          652
#define LVDL0                         653
#define LVDL                          654
#define LVV1                          655
#define LVDL1                         656
#define LVV2                          657
#define LVDL2                         658
#define LVV3                          659
#define LVDL3                         660
#define LVDEN                         661
#define IRVST                         662
#define OSCCON                        663
#define SCS0                          664
#define SCS                           665
#define SCS1                          666
#define PLLEN                         667
#define LOCK                          668
#define T0CON                         669
#define T0PS                          670
#define T0PS0                         671
#define T0PS1                         672
#define T0PS2                         673
#define PSA                           674
#define T0PS3                         675
#define T0SE                          676
#define T0CS                          677
#define T08BIT                        678
#define T016BIT                       679
#define TMR0ON                        680
#define STATUS                        681
#define C                             682
#define CARRY                         683
#define DC                            684
#define ZERO                          685
#define Z                             686
#define OV                            687
#define OVERFLOW                      688
#define N                             689
#define NEGATIVE                      690
#define INTCON3                       691
#define INT1IF                        692
#define INT1F                         693
#define INT2IF                        694
#define INT2F                         695
#define INT1E                         696
#define INT1IE                        697
#define INT2IE                        698
#define INT2E                         699
#define INT1P                         700
#define INT1IP                        701
#define INT2IP                        702
#define INT2P                         703
#define INTCON2                       704
#define RBIP                          705
#define TMR0IP                        706
#define T0IP                          707
#define INTEDG2                       708
#define INTEDG1                       709
#define INTEDG0                       710
#define RBPU                          711
#define NOT_RBPU                      712
#define nRBPU                         713
#define INTCON                        714
#define RBIF                          715
#define INT0F                         716
#define INT0IF                        717
#define T0IF                          718
#define TMR0IF                        719
#define RBIE                          720
#define INT0E                         721
#define INT0IE                        722
#define T0IE                          723
#define TMR0IE                        724
#define PEIE                          725
#define PEIE_GIEL                     726
#define GIEL                          727
#define GIE_GIEH                      728
#define GIE                           729
#define GIEH                          730
#define STKPTR0                       731
#define STKPTR                        732
#define SP0                           733
#define STKPTR1                       734
#define SP1                           735
#define STKPTR2                       736
#define SP2                           737
#define SP3                           738
#define STKPTR3                       739
#define STKPTR4                       740
#define SP4                           741
#define STKUNF                        742
#define STKOVF                        743
#define STKFUL                        744

#endif // _PIC18C601_H_
